#  List any five functions of the pandas library with execution

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([{"Name":"Aayush","Age":27,"Mark":100},{"Name":"Mayank","Age":31,"Mark":98},{"Name":"Vinay","Age":30,"Mark":98}])

In [3]:
df

     Name  Age  Mark
0  Aayush   27   100
1  Mayank   31    98
2   Vinay   30    98

In [4]:
#shape
df.shape

(3, 3)

In [5]:
#type
type(df)

pandas.core.frame.DataFrame

In [6]:
#unique
df['Name'].unique

<bound method Series.unique of 0    Aayush
1    Mayank
2     Vinay
Name: Name, dtype: object>

In [7]:
#describe
df.describe()

             Age        Mark
count   3.000000    3.000000
mean   29.333333   98.666667
std     2.081666    1.154701
min    27.000000   98.000000
25%    28.500000   98.000000
50%    30.000000   98.000000
75%    30.500000   99.000000
max    31.000000  100.000000

In [8]:
#Info
df.info

<bound method DataFrame.info of      Name  Age  Mark
0  Aayush   27   100
1  Mayank   31    98
2   Vinay   30    98>

In [9]:
#iloc
df.iloc[0:3,[0,1,2]]

     Name  Age  Mark
0  Aayush   27   100
1  Mayank   31    98
2   Vinay   30    98

In [10]:
#loc
df.loc[0:2,['Name','Age']]

     Name  Age
0  Aayush   27
1  Mayank   31
2   Vinay   30

#  Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
df1 = pd.DataFrame([{'A':12,'B':10,'C':21},{'A':110,'B':205,'C':210},{'A':2,'B':0,'C':1}])
df1

     A    B    C
0   12   10   21
1  110  205  210
2    2    0    1

In [12]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [13]:
a=list(df1.index)

In [14]:
a

[0, 1, 2]

In [15]:
y = [1]
def Inc(x):
    for i in x[1:]:
        i = i + 2
        y.append(i)
    print(y)



df1["I"] = Inc(a)

[1, 3, 4]

In [16]:
df1["I"] = y

In [17]:
df1

     A    B    C  I
0   12   10   21  1
1  110  205  210  3
2    2    0    1  4

In [18]:
df1.set_index('I')

     A    B    C
I
1   12   10   21
3  110  205  210
4    2    0    1

# You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [19]:
df = pd.DataFrame({"Values":[10,20,30,40,50,60,70,80,90,100]})
df

   Values
0      10
1      20
2      30
3      40
4      50
5      60
6      70
7      80
8      90
9     100

In [20]:
a=[]
def Add(x):
    for i in x[0:3]:
        a.append(i)
    b=a[0] + a[1] + a[2]
    print(b)
    
Add((df["Values"]))

60

# . Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [21]:
df = pd.DataFrame({"Text":["Vinay","Raman","subh","Shivani","Tariq"]})
df

      Text
0    Vinay
1    Raman
2     subh
3  Shivani
4    Tariq

In [22]:
A = df["Text"].apply(len)

In [23]:
df["Word_Count"] = A

In [24]:
df

      Text  Word_Count
0    Vinay           5
1    Raman           5
2     subh           4
3  Shivani           7
4    Tariq           5

# How are DataFrame.size() and DataFrame.shape() different?

In [25]:
# Output of DataFrame.size() is cross product of Total records and total fields
df.size

10

In [26]:
# Output of DataFrame.shape is tuple repersentation  of total number of rows and column
df.shape

(5, 2)

# Which function of pandas do we use to read an excel file

In [27]:
#pd.read_excel("path of file")

# You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [28]:
df = pd.DataFrame({'Email':['vivek@gmail.com','subham@gmail.com','mayank@gmail.com']})
df

              Email
0   vivek@gmail.com
1  subham@gmail.com
2  mayank@gmail.com

In [29]:
df["Name"]=df["Email"].apply(lambda x:str(x).split('@')[0])

In [30]:
df

              Email    Name
0   vivek@gmail.com   vivek
1  subham@gmail.com  subham
2  mayank@gmail.com  mayank

#  You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [31]:
df = pd.DataFrame({"A": [3,8,6,2,9], "B":[5,2,9,3,1], "C" :[1,7,4,5,2]})
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [32]:
df[(df["A"] > 5) & (df["B"] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

# Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column

In [33]:
df = pd.DataFrame({"values": [4,9,7,3,5,0,10,6,50,12,34]})
df

    values
0        4
1        9
2        7
3        3
4        5
5        0
6       10
7        6
8       50
9       12
10      34

In [34]:
df['values'].mean()

12.727272727272727

In [35]:
df['values'].median()

7.0

In [36]:
df['values'].std()

15.278029382684856

# Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day

In [37]:
df= pd.DataFrame({"Sales":[45000,36000,85000,56000,100000,47000,98000,10000,26000,75000],"Date":
                 ['07-7-2023','07-8-2023','07-9-2023','07-10-2023','07-11-2023','07-12-2023','07-13-2023',
                  '07-14-2023','07-15-2023','07-16-2023']})
df

    Sales        Date
0   45000   07-7-2023
1   36000   07-8-2023
2   85000   07-9-2023
3   56000  07-10-2023
4  100000  07-11-2023
5   47000  07-12-2023
6   98000  07-13-2023
7   10000  07-14-2023
8   26000  07-15-2023
9   75000  07-16-2023

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Sales   10 non-null     int64
 1   Date    10 non-null     object
dtypes: int64(1), object(1)
memory usage: 292.0+ bytes

In [39]:
df['Date']= pd.to_datetime(df['Date'])

In [40]:
df

    Sales       Date
0   45000 2023-07-07
1   36000 2023-07-08
2   85000 2023-07-09
3   56000 2023-07-10
4  100000 2023-07-11
5   47000 2023-07-12
6   98000 2023-07-13
7   10000 2023-07-14
8   26000 2023-07-15
9   75000 2023-07-16

In [41]:
df["MovingAverage"] = df["Sales"].rolling(7).mean()

In [42]:
df

    Sales       Date  MovingAverage
0   45000 2023-07-07            NaN
1   36000 2023-07-08            NaN
2   85000 2023-07-09            NaN
3   56000 2023-07-10            NaN
4  100000 2023-07-11            NaN
5   47000 2023-07-12            NaN
6   98000 2023-07-13   66714.285714
7   10000 2023-07-14   61714.285714
8   26000 2023-07-15   60285.714286
9   75000 2023-07-16   58857.142857

# You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.Monday, Tuesday) corresponding to each date in the 'Date' column.

In [43]:
df = pd.DataFrame({"Date": ['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [44]:
df['Date']= pd.to_datetime(df['Date'])

In [45]:
df['WeekDays']=df['Date'].dt.day_name()

In [46]:
df

        Date   WeekDays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

#  Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [47]:
df = pd.DataFrame({"Date":['2023-01-02','2023-02-21','2023-02-15','2023-03-15','2023-01-12','2023-01-23']})
df["Date"] =pd.to_datetime(df["Date"])
df

        Date
0 2023-01-02
1 2023-02-21
2 2023-02-15
3 2023-03-15
4 2023-01-12
5 2023-01-23

In [50]:
df[(df["Date"] > '2023-01-01') & (df["Date"] <'2023-01-31')]

        Date
0 2023-01-02
4 2023-01-12
5 2023-01-23

#  To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported

In [51]:
#pandas
#eg. import pandas as pd